In [2]:
import pandas as pd
data=[['learning',25],['is',30],['for',26],['fun',20]]
df=pd.DataFrame(data,columns=['tag','number'])
df

        tag  number
0  learning      25
1        is      30
2       for      26
3       fun      20

In [5]:
datas=[['Tom','reacher',24],['Jay','Gordan',22],['Lloyd','Garmadon',19],['Kai','Peterson',22],['Cole','Rock',22],['Zane','Zimmerman',22]]
df1=pd.DataFrame(datas,columns=['Fname','Lname','Age'])
df1

   Fname      Lname  Age
0    Tom    reacher   24
1    Jay     Gordan   22
2  Lloyd   Garmadon   19
3    Kai   Peterson   22
4   Cole       Rock   22
5   Zane  Zimmerman   22

In [16]:
data={'catogory':['array','stack','queue'],
       'marks':[22,19,27]}
df=pd.DataFrame(data)
df

  catogory  marks
0    array     22
1    stack     19
2    queue     27

In [17]:
df.transpose()

              0      1      2
catogory  array  stack  queue
marks        22     19     27

In [23]:
#creating dataframe using csv file
df=pd.read_csv('bmi.csv')
print(df.head())

   Gender  Height  Weight  Index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3